## Production: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 7 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                NAME                                                 |
|--------|-----------------------------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_subscription_filter.sentinel_forwarder`                                         |
|        | `module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda`                      |
|        | `module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda`                                |
|        | `module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda`                                  |
|        | `module.sentinel_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda`                |
|        | `module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder`                                  |
|        | `module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_log_subscription_filter.sentinel_forwarder will be created
  + resource "aws_cloudwatch_log_subscription_filter" "sentinel_forwarder" {
      + destination_arn = (known after apply)
      + distribution    = "Random"
      + filter_pattern  = "[w1=\"*\"]"
      + id              = (known after apply)
      + log_group_name  = "/aws/ecs/wordpress"
      + name            = "All ECS logs"
      + role_arn        = (known after apply)
    }

  # module.sentinel_forwarder.data.aws_iam_policy_document.sentinel_forwarder_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sentinel_forwarder_lambda" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda will be created
  + resource "aws_cloudwatch_log_group" "sentinel_forwarder_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/sentinel-forwarder"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + tags_all          = {
          + "CostCentre" = "PlatformGCArticles"
        }
    }

  # module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda will be created
  + resource "aws_iam_policy" "sentinel_forwarder_lambda" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "SentinelForwarderLambda-sentinel-forwarder"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda will be created
  + resource "aws_iam_role" "sentinel_forwarder_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SentinelForwarderLambda-sentinel-forwarder"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.sentinel_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda will be created
  + resource "aws_iam_role_policy_attachment" "sentinel_forwarder_lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SentinelForwarderLambda-sentinel-forwarder"
    }

  # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder will be created
  + resource "aws_lambda_function" "sentinel_forwarder" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Lambda function to forward AWS logs to Azure Sentinel"
      + filename                       = "/tmp/sentinel_forwarder.py.zip"
      + function_name                  = "sentinel-forwarder"
      + handler                        = "sentinel_forwarder.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:71",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "liR4yJNhp6SJtCjkSwnH0xGC0q00Uxebs1Cyqv8JLDw="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + tags_all                       = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CUSTOMER_ID" = (sensitive value)
              + "LOG_TYPE"    = "ApplicationLog"
              + "SHARED_KEY"  = (sensitive value)
            }
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0] will be created
  + resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sentinel-forwarder"
      + id                  = (known after apply)
      + principal           = "logs.ca-central-1.amazonaws.com"
      + source_arn          = "arn:aws:logs:ca-central-1:472286471787:log-group:/aws/ecs/wordpress:*"
      + statement_id        = "AllowExecutionFromCloudWatchLogs-sentinel-forwarder-0"
      + statement_id_prefix = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_ecs_cluster.wordpress,
  on ecs.tf line 4, in resource "aws_ecs_cluster" "wordpress":
   4: resource "aws_ecs_cluster" "wordpress" {

Use the aws_ecs_cluster_capacity_providers resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.ecs_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ecs_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.wordpress_ecs_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.wordpress_service"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.wordpress_task"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.wordpress_ecs_task_get_ecr_image"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.wordpress_ecs_task_get_secret_value"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.ecs_events_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.wordpress_ecs_task"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.ecs_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.c3_aws_access_key_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.c3_aws_secret_access_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.default_list_manager_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.default_notify_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.encryption_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.jwt_auth_secret_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.list_manager_endpoint"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.s3_uploads_bucket"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.s3_uploads_key"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
